ox_docs/mathematics/linear_algebra/KBe20math530floApplicationPresentations.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-09-26 Sun 09:56 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Application Presentations</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Exr0n" />
<link rel="stylesheet" href="https://taproot3.sanity.gq/global.css" type="text/css"/>
</head>
<body>
<div id="preamble" class="status">
<div class="header"><span class="site"><a href="https://taproot3.sanity.gq">TR3.5</a></span></div><div class="datarow"><h1 class="title">Application Presentations</h1> <h2 class="subtitle"></h2> <span class="author">Exr0n</span> <span class="date">2021-09-11 Sat 16:34</date></div>
</div>
<div id="content">
<h1 class="title">Application Presentations</h1>
<div id="outline-container-org0bd0c17" class="outline-2">
<h2 id="org0bd0c17"><span class="section-number-2">1</span> <span class="done DONE">DONE</span> Brian P: Traffic control</h2>
<div class="outline-text-2" id="text-1">
<p>
model and predict flow through streets using systems of linear equations
</p>
</div>
<div id="outline-container-orgd398612" class="outline-3">
<h3 id="orgd398612"><span class="section-number-3">1.1</span> traffic circle example</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-orga03fe0d" class="outline-4">
<h4 id="orga03fe0d"><span class="section-number-4">1.1.1</span> info</h4>
<div class="outline-text-4" id="text-1-1-1">
</div>
<ol class="org-ol">
<li><a id="org026dec0"></a>cars perminute from each direction<br /></li>
<li><a id="org1a96dc2"></a>but counters only counted four of the road segments<br /></li>
<li><a id="org34e455d"></a>calculate how many cars went through the other road segments<br /></li>
</ol>
</div>
<div id="outline-container-org715e4bd" class="outline-4">
<h4 id="org715e4bd"><span class="section-number-4">1.1.2</span> calculation</h4>
<div class="outline-text-4" id="text-1-1-2">
<p>
$$
</p>
\begin{aligned}
x_2 + 75 = x_5+92\\
x_1+x_2 = x_3+56\\
75 = x_1+x_4\\
x_3+x_4+23 = 46?\\
x_5 = 33
\end{aligned}
<p>
$$
</p>
</div>
</div>
<div id="outline-container-orge48a216" class="outline-4">
<h4 id="orge48a216"><span class="section-number-4">1.1.3</span> Take RREF (it happens to not be the identity, which means there isn't enough information to)</h4>
<div class="outline-text-4" id="text-1-1-3">
</div>
<ol class="org-ol">
<li><a id="orge3ebae1"></a>pivot columns?<br /></li>
<li><a id="org5ffd1ff"></a>replace the dependent variable (in this case \(x_4\) with \(t\), and try to remember how many cars went on the other roads (create parametric equations)<br /></li>
</ol>
</div>
</div>
<div id="outline-container-orge193c8b" class="outline-3">
<h3 id="orge193c8b"><span class="section-number-3">1.2</span> Block example</h3>
<div class="outline-text-3" id="text-1-2">
</div>
<div id="outline-container-orgbd68a90" class="outline-4">
<h4 id="orgbd68a90"><span class="section-number-4">1.2.1</span> goal</h4>
<div class="outline-text-4" id="text-1-2-1">
<p>
Given some flow rates, figure out how many cars should be allowed to go through an area.
Even though there are multiple solutions, it is possible to see which streets will become bottlenecks.
</p>
</div>
</div>
</div>
<div id="outline-container-org59fde21" class="outline-3">
<h3 id="org59fde21"><span class="section-number-3">1.3</span> general steps</h3>
<div class="outline-text-3" id="text-1-3">
</div>
<div id="outline-container-org85b1b84" class="outline-4">
<h4 id="org85b1b84"><span class="section-number-4">1.3.1</span> assign variables</h4>
</div>
<div id="outline-container-org64339b1" class="outline-4">
<h4 id="org64339b1"><span class="section-number-4">1.3.2</span> create system of equations</h4>
</div>
<div id="outline-container-org71a5d52" class="outline-4">
<h4 id="org71a5d52"><span class="section-number-4">1.3.3</span> create matrix</h4>
</div>
<div id="outline-container-org737133a" class="outline-4">
<h4 id="org737133a"><span class="section-number-4">1.3.4</span> use gaussian elimination to gain information</h4>
</div>
</div>
<div id="outline-container-org06d50f2" class="outline-3">
<h3 id="org06d50f2"><span class="section-number-3">1.4</span> with this information you can</h3>
<div class="outline-text-3" id="text-1-4">
</div>
<div id="outline-container-org3cb3ede" class="outline-4">
<h4 id="org3cb3ede"><span class="section-number-4">1.4.1</span> adjust traffic light timings</h4>
</div>
</div>
<div id="outline-container-orga87c0de" class="outline-3">
<h3 id="orga87c0de"><span class="section-number-3">1.5</span> more complexity</h3>
<div class="outline-text-3" id="text-1-5">
</div>
<div id="outline-container-org9dc295a" class="outline-4">
<h4 id="org9dc295a"><span class="section-number-4">1.5.1</span> some examples with 120 variables or more</h4>
</div>
<div id="outline-container-org1a02128" class="outline-4">
<h4 id="org1a02128"><span class="section-number-4">1.5.2</span> done by computers</h4>
</div>
<div id="outline-container-org83760f7" class="outline-4">
<h4 id="org83760f7"><span class="section-number-4">1.5.3</span> jamiton lines/envelopes (phantom traffic slowdowns)</h4>
</div>
</div>
<div id="outline-container-org4ab3b2f" class="outline-3">
<h3 id="org4ab3b2f"><span class="section-number-3">1.6</span> limitations</h3>
<div class="outline-text-3" id="text-1-6">
</div>
<div id="outline-container-org10c7f14" class="outline-4">
<h4 id="org10c7f14"><span class="section-number-4">1.6.1</span> spikes of traffic vary based on time of day or year</h4>
</div>
<div id="outline-container-org421b24a" class="outline-4">
<h4 id="org421b24a"><span class="section-number-4">1.6.2</span> routes are not considered</h4>
</div>
<div id="outline-container-org4877a21" class="outline-4">
<h4 id="org4877a21"><span class="section-number-4">1.6.3</span> size / type of vehicle</h4>
</div>
<div id="outline-container-org7591b8b" class="outline-4">
<h4 id="org7591b8b"><span class="section-number-4">1.6.4</span> speed of vehicles</h4>
</div>
<div id="outline-container-org2a391c5" class="outline-4">
<h4 id="org2a391c5"><span class="section-number-4">1.6.5</span> line of sight</h4>
<div class="outline-text-4" id="text-1-6-5">
</div>
</div>
</div>
</div>
</div>
</body>
</html>
